api/controllers/ApiController.php

    public function actionGetallprovince()
    {
        ini_set("memory_limit","1000M");
       //$provinces=Provinces::find()->joinWith(['polygons'])->asArray()->cache(true)->where(['provinces.id'=>1])->all();
       $provinces=Provinces::find()->joinWith(['polygons'])->asArray()->cache(true)->all();
---
SELECT `provinces`.* FROM `provinces` LEFT JOIN `polygon` ON `provinces`.`id` = `polygon`.`provinces_id` WHERE `provinces`.`id`=1